app/views/todos/_todo.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "todo_categories" ON "categories"."id" = "todo_categories"."category_id" WHERE "todo_categories"."todo_id" = ?  [["todo_id", 1]]
---
     <i class=" fa fa-tags " title="categories"></i>
    <% todo.categories.each do |category| %>

SELECT COUNT(*) FROM "comments"  WHERE "comments"."todo_id" = ?  [["todo_id", 1]]
---
      <% end %>
      <p><%= notes_indicator(todo) %> <span class="badge"><%= todo.comments.count %></span></p>